<?php

namespace codesaur\Http\Client\Example;

/* DEV: v2.2023.09.17
 * 
 * This is an example script!
 */

\ini_set('display_errors', 'On');
\error_reporting(\E_ALL);

require_once '../vendor/autoload.php';

use codesaur\Http\Client\Mail;

$mail = new Mail();
$mail->targetTo('tsedenbal@example.com', 'Цэдэнбал Юмжаа');
$mail->setFrom('codeasur@example.com', 'Наранхүү');
$mail->setSubject('ФОТО: Төр нийгмийн нэрт зүтгэлтэн маршал Ю.Цэдэнбал агсан мэндэлсний 107 жилийн ой өнөөдөр тохиож байна');
$mail->setMessage(
    '<html><body style="text-align:justify"><p>Өнөөдөр төр нийгмийн нэрт зүтгэлтэн БНМАУ-ын баатар, Хөдөлмөрийн баатар маршал <strong>Ю.Цэдэнбал</strong> агсны мэндэлсний 107 жилийн ой тохиож байна.</p>
    <span>Энэ өдрөөр түүний хөшөөнд цэцэг өргөх хүндэтгэлийн ёслол боллоо.</span>
    <p>Уг ёслолын үеэр МАН-ын ерөнхий нарийн бичгийн дарга Д.Амарбаясгалан "БНМАУ-ын баатар, Хөдөлмөрийн баатар маршал Ю.Цэдэнбал бол өнгөрсөн зууны бүтээн байгуулалт өөрчлөлт шинэчлэлтэд сэтгэл оюунаа бүрэн дайчилж, хойч үеийнхэндээ ихийг үлдээж чадсан хүн. Түүний улс орныг удирдсан 44 жилийн хугацаанд Монгол Улс аж үйлдвэр, аж ахуй, боловсрол, эрүүл мэнд, шинжлэх ухааны салбаруудад их үсрэлтийг хийсэн. Ю.Цэдэнбалын тууштай, тогтвортой бодлогын үр дүн өнөөдөр ч бидний амьдралд нөлөөлсөөр байна. Түүний Монгол төрд оруулсан хувь нэмэр, нэр төр, их гавьяа зүтгэлийг үлгэр дуурайлал болгож Монгол хүн Монгол түмэн, эх орныхоо төлөө хэрхэн ажиллаж, тэмцэж болдог сайн жишгийг харж санаж явах учиртай" гэлээ.</p></body></html>');

$mail->addFileAttachment(\dirname(__FILE__) . '/Ю.Цэдэнбал агсаны хөшөө.jpg');

$script_link = $_SERVER['SCRIPT_NAME'];
if ($script_link == '\\' || $script_link == '/' || $script_link == '.') {
    $script_link = '';
}
$script_path = $_SERVER['REQUEST_SCHEME'] . '://';
$script_path .= $_SERVER['SERVER_NAME'] . $script_link;
$fileUrl = \dirname($script_path) . '/Tsedenbal.jpg';
$mail->addUrlAttachment($fileUrl);

$mail->addContentAttachment("
Хөх манхан тэнгэрийг эзэгнэнхэн төрлөө би
Хөмсгөн сарны аялах алсын алс тойрогт
Холын хоёр одны тохиох бяцхан чөлөөнд
Хоёр нүдний үзүүрт цэнхэрлэх төдий тэртээд
Хөх манхан тэнгэрийг эзэгнэхэн төрлөө би

Цаст цагаан уулыг эзэгнэнхэн төрлөө би
Цан хvvрэг савсаж vvлс ороох оргилд
Цасан ширхэг царцаж мөс болох халилд
Царгиа хvйтэн өвөлд сарлагийн бух дошсон
Цаст цагаан уулыг эзэгнэнхэн төрлөө би

Онгон цэнхэр талыг эзэгнэнхэн төрлөө би
Орог саарал зэрэглээ хавар сvvмэлзэх хөндийд
Орсон буурийн шvд өвөл хангинах хоолойд
Yлэг гvрвэлийн мөрийг өдий хvртэл хадгалсан
Онгон цэнхэр талыг эзэгнэнхэн төрлөө би
", 'Б.Явуухулан : Би хаана төрөө вэ?.txt');

$mail->addRecipient('davaajargal@example.com', 'Даваажаргал Хакухо');
$mail->addCCRecipient('user@example.com', 'Хэрэглэгч');
$mail->addCCRecipient('unen@example.com', 'Tsedenbal-_[]().jpg');
$mail->addBCCRecipient('mongol@example.com', 'Mongol Uls');

$mail->send();
